# 1. Объявляем функцию с помощью 'def', даем ей имя и указываем входящий параметр (region)
def get_delivery_cost(region:str):
    # 2. Блок условий
    if region == "Москва":
        return 500
    elif region == "Сибирь":
        return 1500
    else:
        # else срабатывает, если ни одно из условий выше не подошло
        return 1000 

# 3. Основной код: вызываем функцию, передаем ей значение и сохраняем результат
current_cost = get_delivery_cost("Сибирь")
# print(f"Стоимость доставки: {current_cost}")


# Коммерческий отдел просит написать логику, 
# которая будет автоматически маркировать статус 
# товара для сайта в зависимости от того, сколько штук осталось
# на складе.
def check_stock(quantity):
    if quantity > 10:
        return 'В наличии'
    elif quantity > 0:
        return 'заканчивается'
    return 'нет в наличии'
print(check_stock(5))