-- ТЕОРИЯ
ФУНКЦИЯ() OVER (
    PARTITION BY колонка_группировки -- 1. «Комнаты»: на какие группы делим данные
    ORDER BY колонка_сортировки      -- 2. «Порядок»: в каком порядке обходим строки в комнате
    ROWS BETWEEN ... AND ...         -- 3. «Фрейм»: сколько строк до/после текущей захватываем
)

-- LAG(колонка) — забирает значение из предыдущей строки внутри окна 
-- (от слова lag — отставать).
-- LEAD(колонка) — забирает значение из следующей строки внутри окна 
-- (от слова lead — вести, опережать)

-- ПРИМЕР
select product_name, sale_date, category, price,
lag(price) OVER (PARTITION BY category ORDER BY sale_date)
from sales_mart;
-- база разобьет таблицу по категориям, отсортирует по дате, и в новой колонке 
-- напротив каждого чека появится цена из предыдущего чека. 
-- У самой первой строки в окне предыдущей строки нет, поэтому там будет стоять null
-- (и после новой категории null)

-- ЗАДАЧА
-- 1. Коммерческий директор хочет проанализировать хронологию успешных продаж 
-- (status = 'Completed') и сравнить выручку каждого чека с выручкой 
-- последующего успешного чека в этой же категории
select sale_id, product_name, sale_date, category,
	price * quantity as "Текущий чек",
lead(price * quantity) over(
	partition by category
	order by sale_date, sale_id
)
from sales_mart
where status = 'Completed';















